Reports/МедицинскийОтчет001у.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>МедицинскийОтчет001у</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ПаспортныеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПаспортныеДанные</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументВид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыУдостоверяющиеЛичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииПоМестуЖительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОбращениеВСтационар.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОбращениеВСтационар</Name>
			<BasedOn>
				<xr:Item>Document.Прием</xr:Item>
				<xr:Item>Document.БронированиеКойкоМеста</xr:Item>
				<xr:Item>Document.Заявка</xr:Item>
				<xr:Item>Document.ОказаниеУслуг</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедицинскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛечащийВрач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправившееУчреждение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиагнозНаправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиагнозПоступления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьДоставленСкоройПомощью</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставленПоЭкстреннымПоказателям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧерезЧасовПослеНачалаЗаболевания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаГоспитализации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщитьРодственникам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказВГоспитализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказаВГоспитализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.удалитьПричиныОтказаВГоспитализации</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйПовторныйОтказ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтказаВГоспитализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяОтказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятыеМеры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рекомендации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНаправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачиНаправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналГоспитализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыГоспитализации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНаряда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлкогольноеОпьянение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаркотическоеОпьянение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяГоспитализации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникЗафиксировавшийОтказ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказЗаконныйПредставитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпьянениеДатаВремяВзятияПробы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпьянениеРезультатВзятияПробы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяИнформированияЗП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторноеПоступление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтационараНаправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтационара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/МедицинскийОтчет001у/Ext/ObjectModule.bsl
#Область РазделОписанияПеременных
Перем мВерсияОтчета Экспорт;// Строка, версия отчета
#КонецОбласти

#Область ПрограммныйИнтерфейс

// Таблица форм отчета
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица форм отчета.
//
Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 5);
	ТаблицаФормОтчета.Колонки.Добавить("РедакцияФормы",      ОписаниеТиповСтрока, "Редакция формы", 20);
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета";
	НоваяФорма.ОписаниеОтчета     = "Журнал учета приема пациентов и отказов в оказании медицинской помощи в стационарных условиях, в условиях дневного стационара";
	НоваяФорма.РедакцияФормы      = "от 05.08.2022 № 1";
	НоваяФорма.ДатаНачалоДействия = '20230301';
	НоваяФорма.ДатаКонецДействия  = МедицинскаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));
			
	Возврат ТаблицаФормОтчета;
	
КонецФункции

// Периодичность отчета.
//
// Параметры:
//  ПараметрыОтчета	 - Неопределено - не используется.
// 
// Возвращаемое значение:
//  Строка - периодичность Год, Полугодие, Квартал, Месяц, День.
//
Функция ПериодичностьОтчета(ПараметрыОтчета = Неопределено) Экспорт
	
	Возврат "День"; // "Год,Полугодие,Квартал,Месяц,День".
	
КонецФункции

// Структура страниц отчета.
//
// Параметры:
//  ВыбраннаяФорма		 - ФормаКлиентскогоПриложения - форма
//  мДеревоСтраницОтчета - ДанныеФормыДерево - дерево страниц отчета
//
Процедура ФормироватьСтруктуруСтраницОтчета(ВыбраннаяФорма, мДеревоСтраницОтчета) Экспорт
	
	мДеревоСтраницОтчета.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Титульный";
	СтрокаУровня1.Представление            = "Титульный";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
КонецПроцедуры

// Установить доступность областей.
//
// Параметры:
//  ВыбраннаяФорма		 - ФормаКлиентскогоПриложения - форма
//  Форма				 - ФормаКлиентскогоПриложения - форма 
//  ИмяСтраницыПанели	 - Строка - имя страницы панели.
//
Процедура УстановитьДоступностьОбластей(ВыбраннаяФорма, Форма, ИмяСтраницыПанели = "") Экспорт
	
	ТабДокумент = Форма.ПолеТабличногоДокументаФормаОтчета;
	
	ЗапрещенныеОбласти = Новый Массив;
	ЗапрещенныеОбласти.Добавить("Область1");
	ЗапрещенныеОбласти.Добавить("Подпись");
	ЗапрещенныеОбласти.Добавить("ОтчетГод");
	ЗапрещенныеОбласти.Добавить("Область2");
	
	ОбластиРучноеРедактирование = Новый Массив;
	ОбластиРучноеРедактирование.Добавить("ФИОПодпись");
	ОбластиРучноеРедактирование.Добавить("ДатаНачала");
	ОбластиРучноеРедактирование.Добавить("ДатаОкончания");
	ОбластиРучноеРедактирование.Добавить("КодОКУД");
	
	Для Каждого Область Из ТабДокумент.Области Цикл
		Если ЗапрещенныеОбласти.Найти(Область.Имя) = Неопределено И ОбластиРучноеРедактирование.Найти(Область.Имя) = Неопределено Тогда
			МедицинскаяОтчетностьВызовСервера.РазрешитьВводДанныхВОбласть(Форма.мСтруктураЦветовРаскраски["_4"], Область);
		ИначеЕсли ОбластиРучноеРедактирование.Найти(Область.Имя) <>  Неопределено Тогда
			МедицинскаяОтчетностьВызовСервера.РазрешитьВводДанныхВОбласть(Форма.мСтруктураЦветовРаскраски["_0"], Область);	
		КонецЕсли; 		
	КонецЦикла;
			
КонецПроцедуры
 
// Возвращает заголовок формы создания сед. отчетности
// 
// Возвращаемое значение:
// Строка  - Заголовок формы
//
Функция ПолучитьЗаголовокФормы() Экспорт
	
	Возврат "Журнал учета приема пациентов и отказов в оказании медицинской помощи в стационарных условиях, в условиях дневного стационара";
	
КонецФункции

#Область АлгоритмЗаполнения

// Заполнить отчет.
//
// Параметры:
//  ВыбраннаяФорма			 - ФормаКлиентскогоПриложения	 - форма
//  ПараметрыОтчета			 - Структура					 - параметры отчета
//  ЭтаФорма				 - ФормаКлиентскогоПриложения	 - форма
//  СтруктураРеквизитовФормы - Структура					 - структура реквизитов формы.
//
Процедура ЗаполнитьОтчет(ВыбраннаяФорма, ПараметрыОтчета, ЭтаФорма, СтруктураРеквизитовФормы) Экспорт 
	
	ДатаНачала = ?(ЗначениеЗаполнено(ЭтаФорма.ПолеТабличногоДокументаФормаОтчета.Область("ДатаНачала").Значение),ЭтаФорма.ПолеТабличногоДокументаФормаОтчета.Область("ДатаНачала").Значение, Неопределено);
	ДатаОкончания = ?(ЗначениеЗаполнено(ЭтаФорма.ПолеТабличногоДокументаФормаОтчета.Область("ДатаОкончания").Значение),КонецДня(ЭтаФорма.ПолеТабличногоДокументаФормаОтчета.Область("ДатаОкончания").Значение), Неопределено);
	
	Контейнер = Новый Структура();
	 
	Контейнер.Вставить("МногострочныеДанные");
	Контейнер.Вставить("НаименованиеАдресЛПУ");
	
	Контейнер.МногострочныеДанные = ПолучитьТаблицуМногострочныеДанные(ДатаНачала, ДатаОкончания, ПараметрыОтчета.Филиал);;
	Контейнер.НаименованиеАдресЛПУ = ПараметрыОтчета.Филиал.НазваниеОрганизации + " " + КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(ПараметрыОтчета.Филиал, Перечисления.ТипыКонтактнойИнформации.Адрес);
	
	ВнестиМногоСтрочнуюДинамичнуюТаблицу(ЭтаФорма, "Титульный", Контейнер.МногострочныеДанные, "ОбластьСтрока");
	ЭтаФорма["СтруктураДанныхСтраниц"]["Титульный"].Вставить("НаименованиеАдресЛПУ",Контейнер.НаименованиеАдресЛПУ);
	
КонецПроцедуры

Функция ПолучитьТаблицуМногострочныеДанные(НачалоПериода, КонецПериода, Филиал)
		
	ТаблицаДанных = Новый ТаблицаЗначений();
	
	Для Счетчик = 1 По 23 Цикл
		ТаблицаДанных.Колонки.Добавить("Колонка" + Строка(Счетчик));
	КонецЦикла;
	
	ПоступившиеЗаПериод = ПолучитьПоступившихЗаПериод(НачалоПериода, КонецПериода, Филиал);
	
	Счетчик = 1;
	Для Каждого Обращение Из ПоступившиеЗаПериод Цикл
		
		Клиент = Обращение.Клиент;
		ПаспортныеДанные = ПолучитьПаспортныеДанныеКлиента(Клиент, КонецПериода); 
				
		СтрокаДанных = ТаблицаДанных.Добавить();
		СтрокаДанных.Колонка1 = Счетчик;
		СтрокаДанных.Колонка2 = Обращение.ДатаВремяПоступления;
		СтрокаДанных.Колонка3 = Обращение.ДатаВремяПоступления;
		СтрокаДанных.Колонка4 = Клиент;
		СтрокаДанных.Колонка5 = Клиент.ДатаРождения;
		СтрокаДанных.Колонка6 = Клиент.Пол;
		Если ПаспортныеДанные <> Неопределено Тогда
			СтрокаДанных.Колонка7 = ПаспортныеДанные.ДокументСерия + " " + ПаспортныеДанные.ДокументНомер;
		КонецЕсли;
		// Гражданство
		Гражданство = Клиент.Гражданство;
		Если Не ЗначениеЗаполнено(Гражданство) Тогда
			Гражданство = Справочники.СтраныМира.Россия;
		КонецЕсли;
		НаименованиеСтраны = ?(ЗначениеЗаполнено(Гражданство.НаименованиеПолное), Гражданство.НаименованиеПолное, Гражданство.Наименование);
		СтрокаДанных.Колонка8 = НаименованиеСтраны;
		
		СтрокаДанных.Колонка9 = КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(Клиент, Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
		СтрокаДанных.Колонка10 = КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(Клиент, Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.АдресФактический);
		СтрокаДанных.Колонка10 = СокрЛП(Строка(СтрокаДанных.Колонка10) + " " + Клиент.ЗаконныйПредставительТелефон);
		СтрокаДанных.Колонка11 = Клиент.СНИЛС;
		
		ПолисОМС = МедицинскоеСтрахование.ПолисОМСКлиента(Клиент, КонецПериода);
		Если ЗначениеЗаполнено(ПолисОМС.Полис) Тогда
			СтрокаДанных.Колонка12 = СокрЛП(ПолисОМС.НомерПолиса + " " + ПолисОМС.СерияПолиса);
		КонецЕсли;
		
		СтрокаДанных.Колонка13 = Обращение.КаналГоспитализации;
		СтрокаДанных.Колонка14 = Обращение.МедицинскаяКарта.НомерКарты;
		СтрокаДанных.Колонка15 = ?(ТипЗнч(Обращение.ДиагнозНаправления) = Тип("Строка"),Обращение.ДиагнозНаправления, Обращение.ДиагнозНаправления.КодДиагноза);
		СтрокаДанных.Колонка16 = ?(ТипЗнч(Обращение.ДиагнозПоступления) = Тип("Строка"),Обращение.ДиагнозПоступления, Обращение.ДиагнозПоступления.КодДиагноза);
		
		// Колонка 17 (алкоголь, нарктики).
		Если Обращение.АлкогольноеОпьянение И Обращение.НаркотическоеОпьянение Тогда
			СтрокаДанных.Колонка17 = "Употребление алкоголя и иных психоактивных веществ";
		ИначеЕсли Обращение.АлкогольноеОпьянение Тогда
			СтрокаДанных.Колонка17 = "Употребление алкоголя";
		ИначеЕсли Обращение.НаркотическоеОпьянение Тогда
			СтрокаДанных.Колонка17 = "Употребление иных психоактивных веществ";
		Иначе
			СтрокаДанных.Колонка17 = "Нет признаков состояния опьянения";
		КонецЕсли;
		Если ЗначениеЗаполнено(Обращение.ОпьянениеДатаВремяВзятияПробы) Тогда
			СтрокаДанных.Колонка17 = СтрокаДанных.Колонка17 + ". " + "Проба от: " + Формат(Обращение.ОпьянениеДатаВремяВзятияПробы, "ДФ='dd.MM.yyyy HH:mm'");
		КонецЕсли;
		Если ЗначениеЗаполнено(Обращение.ОпьянениеРезультатВзятияПробы) Тогда
			СтрокаДанных.Колонка17 = СтрокаДанных.Колонка17 + ". " + "Результат пробы: " + Обращение.ОпьянениеРезультатВзятияПробы;
		КонецЕсли;
		
		СтрокаДанных.Колонка18 = Обращение.Подразделение;
		
		// Исход госпитализации
		МедКарта = Обращение.МедицинскаяКарта;
		КодCDAПоляИсход = ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(12157, "КлассификаторыМинЗдрава", Перечисления.ВидыКлассификаторовМинЗдрава.КодируемыеПоляCDAДокументов); // Исход.
		КодCDAПоляДатаВыписки = ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(12496, "КлассификаторыМинЗдрава", Перечисления.ВидыКлассификаторовМинЗдрава.КодируемыеПоляCDAДокументов); // Дата выписки
		КодCDAПоляОрганизация = ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(8038, "КлассификаторыМинЗдрава", Перечисления.ВидыКлассификаторовМинЗдрава.КодируемыеПоляCDAДокументов); // Организация, в которую был переведен пациент 
		
		МассивCDA = Новый Массив;
		МассивCDA.Добавить(КодCDAПоляИсход);
		МассивCDA.Добавить(КодCDAПоляДатаВыписки);
		МассивCDA.Добавить(КодCDAПоляОрганизация);
		
		ЗначенияНазначения = МедицинскаяДеятельность.ЗначенияПоНазначениямПолейМедкарты(МедКарта, МассивCDA);
		Если ЗначенияНазначения.Количество() <> 0 Тогда
			// Т.к. значения отсортированы по документу - берем последний документ за тот, который нам нужен
			Документ = ЗначенияНазначения[ЗначенияНазначения.Количество() - 1].Документ;
			ПараметрыДокумента = ЗначенияНазначения.НайтиСтроки(Новый Структура("Документ", Документ));
			
			ИсходГоспитализации = Неопределено;
			ДатаВыписки = Неопределено; 
			Организация = Неопределено;
			// Определяем значения параметров
			Для Каждого СтрокаПараметра Из ПараметрыДокумента Цикл
				Если СтрокаПараметра.Назначение = КодCDAПоляИсход Тогда
					ИсходГоспитализации = СтрокаПараметра.Значение;		
				ИначеЕсли СтрокаПараметра.Назначение = КодCDAПоляДатаВыписки Тогда 
					ДатаВыписки = СтрокаПараметра.Значение;
				ИначеЕсли СтрокаПараметра.Назначение = КодCDAПоляОрганизация Тогда 
					Организация = СтрокаПараметра.Значение;		
				КонецЕсли;
			КонецЦикла;			
			
			Если ИсходГоспитализации <> Неопределено Тогда 
				Если ИсходГоспитализации.УИДЕГИСЗ = 1 		// Выписан
					Или ИсходГоспитализации.УИДЕГИСЗ = 5    // Амбулаторное лечение
				Тогда
					// Выписан
					СтрокаДанных.Колонка19 = ?(ДатаВыписки = Неопределено, "Выписан", "Выписан, " + ДатаВыписки); 
				ИначеЕсли ИсходГоспитализации.УИДЕГИСЗ = 2	// Дневной стационар
					Или ИсходГоспитализации.УИДЕГИСЗ = 3 	// Круглосуточные стационар
					Или ИсходГоспитализации.УИДЕГИСЗ = 4	// Переведен в другую организацию 
				Тогда
					// Переведен в другую организацию 
					СтрокаДанных.Колонка19 = ?(Организация = Неопределено, "Переведен", "Переведен в " + Организация);
					СтрокаДанных.Колонка19 = ?(ДатаВыписки = Неопределено, СтрокаДанных.Колонка19, СтрокаДанных.Колонка19 + ", " + ДатаВыписки);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		СтрокаДанных.Колонка20 = ?(Обращение.СообщитьРодственникам, Обращение.ДатаВремяИнформированияЗП, Неопределено);
		СтрокаДанных.Колонка21 = ?(Обращение.ОтказВГоспитализации, Обращение.ПричинаОтказаВГоспитализации, Неопределено);
		СтрокаДанных.Колонка22 = ?(Обращение.ОтказВГоспитализации, Обращение.СотрудникЗафиксировавшийОтказ, Неопределено);
		СтрокаДанных.Колонка23 = Обращение.ПричинаГоспитализации;
		
		КолонкиНеИзвестно = Новый Массив;
		КолонкиНеИзвестно.Добавить(5);
		КолонкиНеИзвестно.Добавить(6);
		КолонкиНеИзвестно.Добавить(7);
		КолонкиНеИзвестно.Добавить(9);
		КолонкиНеИзвестно.Добавить(11);
		КолонкиНеИзвестно.Добавить(12);
		Для Каждого КолонкаНеИзвестно Из КолонкиНеИзвестно Цикл
			Если Не ЗначениеЗаполнено(СтрокаДанных["Колонка"+КолонкаНеИзвестно]) Тогда
				СтрокаДанных["Колонка"+КолонкаНеИзвестно] = "неизвестно";
			КонецЕсли;
		КонецЦикла;
		
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
	Возврат ТаблицаДанных;
	
КонецФункции

Функция ПолучитьПоступившихЗаПериод(НачалоПериода, КонецПериода, Филиал)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбращениеВСтационар.ДатаВремяПоступления КАК ДатаВремяПоступления,
	               |	ОбращениеВСтационар.Клиент КАК Клиент,
	               |	ОбращениеВСтационар.КаналГоспитализации КАК КаналГоспитализации,
	               |	ОбращениеВСтационар.МедицинскаяКарта КАК МедицинскаяКарта,
	               |	ОбращениеВСтационар.ДиагнозПоступления КАК ДиагнозПоступления,
	               |	ОбращениеВСтационар.ДиагнозНаправления КАК ДиагнозНаправления,
	               |	ОбращениеВСтационар.АлкогольноеОпьянение КАК АлкогольноеОпьянение,
	               |	ОбращениеВСтационар.НаркотическоеОпьянение КАК НаркотическоеОпьянение,
	               |	ОбращениеВСтационар.ОпьянениеДатаВремяВзятияПробы КАК ОпьянениеДатаВремяВзятияПробы,
	               |	ОбращениеВСтационар.ОпьянениеРезультатВзятияПробы КАК ОпьянениеРезультатВзятияПробы,
	               |	ОбращениеВСтационар.Подразделение КАК Подразделение,
	               |	ОбращениеВСтационар.СообщитьРодственникам КАК СообщитьРодственникам,
	               |	ОбращениеВСтационар.ДатаВремяИнформированияЗП КАК ДатаВремяИнформированияЗП,
	               |	ОбращениеВСтационар.ОтказВГоспитализации КАК ОтказВГоспитализации,
	               |	ОбращениеВСтационар.ПричинаОтказаВГоспитализации КАК ПричинаОтказаВГоспитализации,
	               |	ОбращениеВСтационар.СотрудникЗафиксировавшийОтказ КАК СотрудникЗафиксировавшийОтказ,
	               |	ОбращениеВСтационар.ПричинаГоспитализации КАК ПричинаГоспитализации
	               |ИЗ
	               |	Документ.ОбращениеВСтационар КАК ОбращениеВСтационар
	               |ГДЕ
	               |	ОбращениеВСтационар.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ОбращениеВСтационар.Филиал = &Филиал
	               |	И НЕ ОбращениеВСтационар.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Филиал", Филиал);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Результат);
	
КонецФункции

Функция ПолучитьПаспортныеДанныеКлиента(Клиент, КонецПериода)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПаспортныеДанныеСрезПоследних.ДокументВид КАК ДокументВид,
	               |	ПаспортныеДанныеСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ПаспортныеДанныеСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ПаспортныеДанныеСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ПаспортныеДанныеСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ПаспортныеДанныеСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ПаспортныеДанныеСрезПоследних.ДатаРегистрацииПоМестуЖительства КАК ДатаРегистрацииПоМестуЖительства
	               |ИЗ
	               |	РегистрСведений.ПаспортныеДанные.СрезПоследних(&Период, ) КАК ПаспортныеДанныеСрезПоследних
	               |ГДЕ
	               |	ПаспортныеДанныеСрезПоследних.ФизЛицо = &Клиент";
	
	Запрос.УстановитьПараметр("Период", КонецПериода);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СформироватьДатуДокумента(Дата)
	
	ФорматДата = Формат(Дата, "ДЛФ=DD");
	Месяц = Сред(ФорматДата,СтрНайти(ФорматДата," ") + 1, СтрДлина(ФорматДата) - 7 - СтрНайти(ФорматДата," "));
	
	Возврат Символ(34) + День(Дата) + Символ(34) + " " + Месяц + " " + Формат(Год(Дата),"ЧГ=0") + "г."; 
	
КонецФункции

Процедура ВнестиМногоСтрочнуюДинамичнуюТаблицу(ЭтаФорма, ИмяРаздела, Таблица, ИмяОбластиСтрок, ВыводитьПустыеСтроки = Ложь)
	
	СтруктураДанных = ЭтаФорма["СтруктураДанныхСтраниц"][ИмяРаздела];
	МаксКол = Таблица.Колонки.Количество();	

	Если Таблица.Количество() = 0 Тогда
		Стр = 1;
		ИмяЯчейки = ИмяОбластиСтрок + "__" + Формат(1, "ЧЦ=3; ЧВН=") + "_" + Строка(Стр);
		Пока СтруктураДанных.Свойство(ИмяЯчейки) Цикл
			Для Сч = 0 По МаксКол - 1 Цикл
				ИмяЯчейки = ИмяОбластиСтрок + "__" + Формат(Сч + 1, "ЧЦ=3; ЧВН=") + "_" + Строка(Стр);
				СтруктураДанных.Удалить(ИмяЯчейки);
			КонецЦикла;
			Стр = Стр + 1;
			ИмяЯчейки = ИмяОбластиСтрок + "__" + Формат(1, "ЧЦ=3; ЧВН=") + "_" + Строка(Стр);
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Стр = 1;
	Для каждого СтрокаТаблицы Из Таблица Цикл
		Для Сч = 0 По МаксКол - 1 Цикл
			ИмяЯчейки = ИмяОбластиСтрок + "__" + Формат(Сч + 1, "ЧЦ=3; ЧВН=") + "_" + Строка(Стр);	
			Значение = СтрокаТаблицы[Сч]; 
			Если ЗначениеЗаполнено(Значение) Или ВыводитьПустыеСтроки Тогда
				СтруктураДанных.Вставить(ИмяЯчейки,Значение);
			ИначеЕсли СтруктураДанных.Свойство(ИмяЯчейки) Тогда 
				СтруктураДанных.Удалить(ИмяЯчейки);	
			КонецЕсли;
		КонецЦикла;
		Стр = Стр + 1;
	КонецЦикла;
	
КонецПроцедуры
 
#КонецОбласти

#Область Расшифровка

// Установить параметры расшифровки.
//
// Параметры:
//  ВыбраннаяФорма	 - ФормаКлиентскогоПриложения - форма
//  ПараметрыОтчета	 - Структура - параметры отчета 
//  ИмяЯчейки		 - Строка - имя ячейки
// 
// Возвращаемое значение:
//  Структура - параметры расшифровки.
//
Функция УстановитьПараметрыРасшифровки(ВыбраннаяФорма, ПараметрыОтчета, ИмяЯчейки) Экспорт
	
	ПараметрыРасшифровки = Новый Структура();
	
	ИмяФормыРасшифровкиОтчета = "Отчет.РасшифровкаМедицинскогоОтчета1Здрав.ФормаОбъекта";
	ГруппыДиагнозов = ПолучитьГруппуЯчейки(ИмяЯчейки);
	Если НЕ ЗначениеЗаполнено(ГруппыДиагнозов) И НЕ ПараметрыОтчета.ТекущаяСтрокаРазделовОтчета = 6 Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыРасшифровки = Новый Структура();	
	ПараметрыРасшифровки.Вставить("Группа", ГруппыДиагнозов);
	ПараметрыРасшифровки.Вставить("ГраницаЛет", ПолучитьОтборЛет(ИмяЯчейки));
	ПараметрыРасшифровки.Вставить("НачалоПериода", ПараметрыОтчета.ДатаНачалаПериодаОтчета);
	ПараметрыРасшифровки.Вставить("КонецПериода", ПараметрыОтчета.ДатаКонцаПериодаОтчета);
	ПараметрыРасшифровки.Вставить("Филиал", ПараметрыОтчета.Филиал);
	//ПараметрыРасшифровки.Найти("Период").Значение.ДатаНачала = ПараметрыОтчета.ДатаНачалаПериодаОтчета;
	//ПараметрыРасшифровки.Найти("Период").Значение.ДатаОкончания = ПараметрыОтчета.ДатаКонцаПериодаОтчета;

	Возврат Новый Структура("ИмяФормыРасшифровкиОтчета, ПараметрыРасшифровки", ИмяФормыРасшифровкиОтчета, ПараметрыРасшифровки);
	
КонецФункции

// Получить группу для ячейки.
//
// Параметры:
//  ИмяЯчейки	 - Строка - имя ячейки
// 
// Возвращаемое значение:
//  Строка - группа ячейки.
//
Функция ПолучитьГруппуЯчейки(ИмяЯчейки) Экспорт
	
	Если СтрНайти(ИмяЯчейки,"П010000101") = 0 Тогда
		Возврат "";	
	КонецЕсли; 
		
	ГруппыДиагнозов = Новый Массив;
	ГруппыДиагнозов.Добавить("A00-T98");
	ГруппыДиагнозов.Добавить("A00-B99");
	ГруппыДиагнозов.Добавить("C00-D48");
	ГруппыДиагнозов.Добавить("D50-D89");
	ГруппыДиагнозов.Добавить("E00-E89");
	ГруппыДиагнозов.Добавить("F01,F03-F99");
	ГруппыДиагнозов.Добавить("G00-G98");
	ГруппыДиагнозов.Добавить("H00-H59");
	ГруппыДиагнозов.Добавить("H60-H95");
	ГруппыДиагнозов.Добавить("I00-I99");
	ГруппыДиагнозов.Добавить("J00-J98");
	ГруппыДиагнозов.Добавить("K00-K92");
	ГруппыДиагнозов.Добавить("L00-L98");
	ГруппыДиагнозов.Добавить("M00-M99");
	ГруппыДиагнозов.Добавить("N00-N99");
	ГруппыДиагнозов.Добавить("O00-O99");
	ГруппыДиагнозов.Добавить("P00-P96");
	ГруппыДиагнозов.Добавить("Q00-Q99");
	ГруппыДиагнозов.Добавить("R00-R99");
	ГруппыДиагнозов.Добавить("S00-T98");
	
	Попытка
		ИндексЯчейки = Число(СтрЗаменить(ИмяЯчейки, Лев(ИмяЯчейки,14), "")) - 1;	
	Исключение
	    Возврат "";
	КонецПопытки; 
	
	Результат = ГруппыДиагнозов.Получить(ИндексЯчейки);
		
	Возврат Результат;	
	
КонецФункции

Функция ПолучитьОтборЛет(ИмяЯчейки)
	Если СтрНайти(ИмяЯчейки,"П010000101") = 0 Тогда
		Возврат 0;	
	КонецЕсли;
	
	Попытка
		Колонка = Число(Сред(ИмяЯчейки,11,3));	
		Если Колонка = 1 Тогда
			Возврат 0;
		ИначеЕсли Колонка = 2 Тогда 
			Возврат 18;
		Иначе
			Возврат 1;
		КонецЕсли; 
	Исключение
	    Возврат 0;
	КонецПопытки; 
	
КонецФункции

#КонецОбласти

Процедура ВнестиТаблицуВТабДокумент(ЭтаФорма, СтруктураРеквизитовФормы, ИмяРаздела, Таблица, КолонкаСтарт = 0, СтруктураДанныхИсходная = Неопределено)

	Если Таблица = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	ТабДокумент = ЭтаФорма.ПолеТабличногоДокументаФормаОтчета;
	МаксКол = Таблица.Колонки.Количество();
	Стр = 1;
	СтруктураДанных = ЭтаФорма["СтруктураДанныхСтраниц"][ИмяРаздела];
	ЗаноситьВчейки = СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	Для каждого СтрокаТаблицы Из Таблица Цикл
		Для Сч = КолонкаСтарт По МаксКол - 1 Цикл
			ИмяЯчейки = "П010000101" + Формат(Сч + 1 - КолонкаСтарт, "ЧЦ=3; ЧВН=") + "_" + Строка(Стр);
			Значение = СтрокаТаблицы[Сч];
			Если ЗаноситьВчейки Тогда
				ТабДокумент.Области[ИмяЯчейки].Значение = Значение;		
			КонецЕсли; 
			Если ЗначениеЗаполнено(Значение) Тогда
				СтруктураДанных.Вставить(ИмяЯчейки,Значение);
			ИначеЕсли СтруктураДанных.Свойство(ИмяЯчейки) Тогда 
				СтруктураДанных.Удалить(ИмяЯчейки);	
			КонецЕсли;
		КонецЦикла;
		Стр = Стр + 1;
	КонецЦикла; 
	
КонецПроцедуры
 
// Получить список разделов для загрузки
//
// Параметры:
//  ВыбраннаяФорма	 - ФормаКлиентскогоПриложения - форма 
// 
// Возвращаемое значение:
//  Массив -  разделы для загрузки.
//
Функция ПолучитьСписокРазделовДляЗагрузки(ВыбраннаяФорма) Экспорт
	
	СписокРазделовДляЗагрузки = Новый Массив;
	СписокРазделовДляЗагрузки.Добавить("Титульный");

	Возврат СписокРазделовДляЗагрузки;
	
КонецФункции

#КонецОбласти

мВерсияОтчета = "1.0";
